Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: བདག་ཅག་གིས་མ་འོངས་པའི་དུས་ངན་པའི་སེམས་ཅན་ཕུང་པོ་ལ་ཆགས་ཤིང་ངན་པར་ལྟ་བ་ལ་ཕན་པ་དང་བདེ་བའི་དོན་གྱི་ཕྱིར་ཕུང་པོ་ལྔ་ལ་ཆགས་པ་བསལ་བའི་ཕྱིར་ཇི་ལྟ་ཇི་ལྟ་བུར་འདུལ་བ་དེ་ལྟ་དེ་ལྟ་བུའི་ཆོས་ཀྱིས་ཕན་པ་དང་བདེ་བའི་དོན་བྱེད་དོ། །
en: ‘For the sake of the benefit and happiness of beings in the dire times of the future who will be attached to and have wrong views about the aggregates, and in order to dispel their attachment to the five aggregates, I will bring benefit and happiness to them with the Dharma, in whatever way will tame them.’

source: དེ་བས་ན་འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཞིག་ཆོས་རྣམས་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་ཤེས་པར་འདོད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པར་འདོད་པ་དང་། དྲན་པའི་མཐུ་ཐོབ་པར་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་གྲངས་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པའི་ཤེས་རབ་འདོད་པ་དང་། ལུས་འདི་བོར་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་ཐོབ་པར་འདོད་པ་དག་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་མི་རྟག་པའི་མཚན་ཉིད་དང་། སྡུག་བསྔལ་བའི་མཚན་ཉིད་དང་། བདག་མེད་པའི་མཚན་ཉིད་དང་། ཡང་དག་པ་མ་ཡིན་པའི་མཚན་ཉིད་དང་། སྙིང་པོ་མེད་པའི་མཚན་ཉིད་དང་། མཐར་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དང་། ཐོག་མ་མེད་པའི་དུས་ནས་མ་སྐྱེས་པའི་མཚན་ཉིད་དུ་བརྟག་པར་བྱའོ། །
en: Therefore, Lokadhara, those bodhisattva great beings who wish to understand the truth of phenomena, who wish to become skilled in discerning the characteristics of phenomena, who wish to attain the power of mindfulness, who wish for the insight that skillfully discerns the categories of phenomena, and who wish to attain unbroken mindfulness from the time they abandon this body until they reach unsurpassed and perfect awakening should investigate the five aggregates for appropriation in terms of their characteristics of impermanence, suffering, selflessness, falsity, hollowness, final emptiness, and being primordially unborn.

source: རྟག་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་པ་ན་
en: When they constantly contemplate this accurately,

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་ཆགས་ཤིང་ཞེན་པ་ཡོངས་སུ་སེལ་བར་འགྱུར་རོ། །
en: they will dispel their attachment and craving for the five aggregates for appropriation.

source: གཞན་ཡང་དེ་ལྟ་བུའི་ཤིན་ཏུ་ཟབ་མོའི་ཆོས་ལ་སྦྱོར་བ་ཡང་ཐོབ་པར་འགྱུར་རོ། །
en: Additionally, they will achieve a connection to this category of profound teaching.

source: འཇིག་རྟེན་འཛིན་སྔོན་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་རིག་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་ཞིང་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Lokadhara, countless immeasurable eons ago, the thus-gone one, the worthy one, the perfect buddha Royal Mountain of Great Intelligence appeared in the world. He was learned and virtuous, a blissful one, a knower of the world, an unsurpassed being, a charioteer who guides beings, a teacher of gods and humans, and a blessed buddha.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོ་དེ་ལ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: Lokadhara, the blessed Royal Mountain of Great Intelligence had eight trillion hearers in his saṅgha, all of whom were worthy ones who had exhausted the defilements.

source: གཞན་ཡང་སློབ་པའི་ས་ལ་གནས་པ་ཕྱིར་མི་ལྡོག་པ་ཡང་ཁྲག་ཁྲིག་ཁྲི་ཕྲག་བརྒྱད་ཅུ་ཡོད་དོ། །
en: Furthermore, he had 800 quadrillion followers who were irreversible on the level of training.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་ནི་ཁྲག་ཁྲིག་ཁྲི་ཕྲག་བརྒྱ་སྟོང་ཡོད་དོ། །
en: There were also one sextillion beings in his assembly of bodhisattva great beings.

source: བཅོམ་ལྡན་འདས་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་སྙེད་དོ། །
en: The lifespan of the blessed Royal Mountain of Great Intelligence was eighty thousand years.

source: འཇིག་རྟེན་འཛིན་དེའི་ཚེ་ན་རྒྱལ་པོ་ཕན་པར་འགྱུར་བ་ཞེས་བྱ་བ་ཡོད་དེ། རྒྱལ་པོ་ཕན་པར་འགྱུར་བ་ཞེས་བྱ་བ་དེ་ལ་གྲོང་ཁྱེར་ཆེན་པོ་ཉི་ཁྲི་སྙེད་དེ་རབ་ཏུ་བདེ་སྐྱིད་པ་དང་ལྡན་པའི་འགྲོ་བས་ཡོངས་སུ་གང་ངོ་། །
en: Lokadhara, at that time there was a king named Bringer of Benefit, who ruled over twenty thousand cities, each of which was filled with happy beings.

source: གྲོང་ཁྱེར་དེ་དག་ཀྱང་ར་བ་རིམ་པ་བདུན་བདུན་གྱིས་བསྐོར་ཏེ། ཆུ་ཞེང་གབ་པར་དཔག་ཚད་བཅུ་གཉིས་ཡོད་དོ། །
en: Each city was encircled by seven concentric walls that were twelve leagues in circumference.

source: དེ་དག་ཀྱང་རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་ཏེ།
en: They were fashioned from the four precious substances.

source: འོབས་ཀྱང་རིམ་པ་བདུན་དང་། བད་ཀྱང་རིམ་པ་བདུན་ཏེ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་སྟེང་གི་ཕྱོགས་ཡོངས་སུ་བཀབ་བོ། །
en: There were seven layers of moats and fences that were covered with a net of various precious substances.

source: གྲོང་ཁྱེར་དང་། འོབས་དང་། ཤིང་དང་། ར་བ་དང་། སྟེང་གི་དྲ་བ་རྣམས་ཀྱང་གསེར་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། མུ་ས་ར་གར་བ་སྟེ་རིན་པོ་ཆེ་བཞི་ལས་བྱས་པའོ། །
en: The cities, moats, trees, walls, and covering nets were fashioned from the four precious substances: gold, beryl, crystal, and coral.

source: གྲོང་ཁྱེར་ཆེན་པོ་དེ་རེ་རེ་ལ་སྐྱེད་མོས་ཚལ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་སྙེད་ཡོད་དེ། དེའི་ནང་གི་ཤིང་ཡང་རིན་པོ་ཆེ་བདུན་གྱི་ཤིང་གིས་ཡོངས་སུ་གང་ངོ་། །
en: There were five hundred parks in each city wherein the trees were made of the seven precious substances.

source: ཤིང་དེ་དག་ཀྱང་རིན་པོ་ཆེའི་གོས་ཀྱི་ཤིང་ཤ་སྟག་གོ། །
en: Each and every tree was adorned with precious fabrics.

source: སྐྱེད་མོས་ཚལ་དེ་དག་རེ་རེ་ན་ཡང་རིན་པོ་ཆེའི་རྫིང་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཡོད་དེ་ཡོན་ཏན་བརྒྱད་ཀྱི་ཆུས་ཡོངས་སུ་གང་ངོ་། །
en: In each park were five hundred jeweled ponds filled with water of the eight qualities.

source: འཇིག་རྟེན་འཛིན་རྒྱལ་པོ་ཕན་པར་འགྱུར་བ་དེ་ལ་བཙུན་མོ་དང་། ཕོ་བྲང་གི་སླས་བརྒྱད་ཁྲི་སྙེད་ཡོད་དེ།
en: Lokadhara, King Bringer of Benefit had eighty thousand queens and members of his court.

source: དེའི་ཚེ་བཙུན་མོ་ཆེན་མོ་དེ་ལ་སྲས་གཉིས་ཡོད་དོ། །གཅིག་ནི་ཚད་མེད་བློ་གྲོས་ཞེས་བྱ། གཅིག་ནི་ཚད་མེད་སྟོབས་ཞེས་བྱ།
en: At that time, his highest queen had two sons: Limitless Intelligence and Limitless Power.

source: འཇིག་རྟེན་འཛིན་རྒྱལ་བུ་དེ་གཉིས་ལོ་བཅུ་དྲུག་ལོན་པ་དང་རྨི་ལམ་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་སྟེ།
en: Lokadhara, when the two boys had reached the age of sixteen, they beheld the Thus-Gone One in a dream.

source: ཤིན་ཏུ་མཛེས་པ་དཔེ་ཟླ་མེད་པས་ན།
en: Since he was incomparably handsome,

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རྒྱལ་མཚན་ལྟ་བུ་མཐོང་ནས་རབ་ཏུ་དགའ་སྟེ་སད་པ་དང་། སོ་སོ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: he appeared to them like a banner made of gold from the Jambū River. This delighted them to the point that they awoke and proclaimed the following verses.

source: ཕོ་བོས་སྨྲས་པ།
en: “The elder brother said this:

source: བདག་གིས་རྐང་གཉིས་མཆོག་ནི་མཐོང་བར་རྨིས། །
en: “ ‘I dreamt that I saw the supreme human.

source: གསེར་མདོག་བསོད་ནམས་བརྒྱ་ཡི་མཚན་གྱིས་བརྒྱན། །
en: He was golden, ornamented by the signs of a hundred merits.

source: ཚད་མེད་པ་ཡི་ཡོན་ཏན་ཡོངས་རྫོགས་པ། །
en: He was replete with limitless virtues.

source: མཐོང་བས་སེམས་ནི་རབ་ཏུ་དགའ་བར་འགྱུར། །
en: When I saw him, my mind was filled with joy.’

source: ནུ་བོས་སྨྲས་པ།
en: “The younger brother said this:

source: བདག་གིས་སངས་རྒྱས་ཉི་ལྟར་ལྡན་པ་རྨིས། །
en: “ ‘I dreamt that I saw the sun-like Buddha.

source: ཤིན་ཏུ་བཟང་ཞིང་མཛེས་པ་ཕུལ་གྱི་མཆོག །
en: He was excellent, the most handsome one can be.

source: རི་ཡི་རྒྱལ་པོ་རི་རབ་ཇི་བཞིན་ཏེ། །
en: Just like Meru, the king of mountains.’

source: ལྷང་ངེར་གསལ་བར་མཐོང་བས་ཤིན་ཏུ་དགའ། །
en: I was overjoyed when I saw him vividly,

source: འཇིག་རྟེན་འཛིན་དེའི་ཚེ་ན་རྒྱལ་བུ་ཚད་མེད་བློ་གྲོས་དང་། ཚད་མེད་སྟོབས་གཉིས་ཕ་མ་གང་ན་བར་སོང་ནས་འདི་སྐད་དུ་བདག་ཅག་གིས་འདི་ལྟ་བུ་དག་རྨི་ལམ་དུ་མཐོང་ངོ་ཞེས་རྨི་ལམ་གྱི་གཏམ་ཕ་མ་ལ་བཟླས་སོ། །
en: “Lokadhara, the two princes Limitless Intelligence and Limitless Power then went before their father and mother to proclaim to their parents the story of what they saw in their dreams.

source: བདག་ཅག་གཉིས་ཀྱིས་སངས་རྒྱས་མཐོང་བར་རྨིས་ཀྱིས་བདག་ཅག་གཉིས་བཅོམ་ལྡན་འདས་གང་ན་བར་མཆི་བར་གསོལ།
en: They said, ‘We dreamt that we saw the Buddha. Please permit us to go see the Blessed One.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་བའང་ཤིན་ཏུ་དཀའ་སྟེ།
en: It is extremely rare for a thus-gone one to appear in the world.

source: བདག་ཅག་བག་མེད་པས་མ་ཚོར་མ་འཚལ་ནས་འདོད་པ་ལྔའི་འདམ་དུ་ལྟུང་སྟེ་
en: In our heedlessness, we have senselessly and unwittingly fallen into the swamp of the five desires.

source: གཟུགས་ཀྱི་འཆིང་བས་རྣམ་པར་བཅིངས་སོ། །
en: We are bound by the fetter of form.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འཆིང་བས་རྣམ་པར་བཅིངས་སོ། །
en: We are bound by the fetters of feeling, perception, formation, and consciousness.

source: བདག་ཅག་ཁྱིམ་ན་གནས་པས་བག་མེད་པའི་ཕྱིར་སངས་རྒྱས་མ་མཐོང་ངོ་ཞེས་གསོལ་ཏོ། །
en: We have not seen the Buddha before, because we have been heedless, living the household life.’

source: འཇིག་རྟེན་འཛིན་རྒྱལ་བུ་དེ་གཉིས་ཀྱིས་ཕ་མ་ལ་དེ་སྐད་ཅེས་སྨྲས་ནས་བཅོམ་ལྡན་འདས་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོ་གང་ན་བ་དེར་སོང་ངོ་། །
en: “Lokadhara, once the two princes announced this to their parents, they went before the blessed Royal Mountain of Great Intelligence.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ནས་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། སངས་རྒྱས་དང་། དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་མཆོད་པ་རྣམ་བཞི་འབུལ་བར་སྤྱན་དྲངས་སོ། །
en: Arriving in the Blessed One’s presence, they bowed, touching the crowns of their heads to his feet and invited the Buddha and his saṅgha of monks with an offering of the four kinds of veneration for a duration of three months.

source: ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དག་གིས་མཆོད་ཅིང་ཕུལ་ཏེ།
en: They offered clothing, food, bedding, and medicine in the case of illness.

source: གྲོང་ཁྱེར་ཆེན་པོའི་མཐའ་རྒྱལ་པོ་ཕན་པར་འགྱུར་བའི་སྐྱེད་མོས་ཚལ་གཅིག་ཏུ་བ་དན་དཔྱངས། གདུགས་བྲེས། རིན་པོ་ཆེའི་པད་མོ་བཀོད་དེ།
en: In one of King Bringer of Benefit’s parks at the edge of the city, they hung banners, raised parasols, and arranged jeweled lotuses.

source: སངས་རྒྱས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ནས་བཞུགས་སུ་གསོལ་ཏོ། །
en: Offering this to the Buddha and his saṅgha of monks, they requested them to stay.

source: རྒྱལ་བུ་དེ་གཉིས་ཀྱིས་ཟླ་བ་གསུམ་གྱི་བར་དུ་མཆོད་པའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་མཆོད་ནས་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་ཁྱིམ་ནས་ཁྱིམ་མ་ཡིན་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: For three months, the two princes served the Buddha and his saṅgha of monks with offerings of supplies, and they went forth into the homeless life under the Blessed One’s teachings.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོ་དེས་རྒྱལ་བུ་དེ་གཉིས་ཀྱི་ལྷག་པའི་བསམ་པ་དང་སྨན་པ་མཁྱེན་ནས་ཕུང་པོ་ལྔ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་བཤད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ཞེས་བྱ་བའི་མདོ་རྒྱས་པར་བཤད་དོ། །
en: “Lokadhara, the blessed Royal Mountain of Great Intelligence understood the two princes’ pure motivation and aspiration and extensively instructed them in the discourse called The Skillful Means of Bodhisattvas , in which the five aggregates, twelve sense sources, and eighteen elements are explained.

source: ལོ་བཞི་ཁྲིའི་བར་དུ་གཉིད་ཀྱང་མ་ལོག །ཟས་ཀྱང་ཆོག་པར་མ་ཟོས། བསྙེས་ཏེ་འཕྲེས་ཀྱང་མ་མྱོང་བར་གལ་ཏེ་འདུག་གམ་འཆག་ཅིང་སོང་ཡང་མ་མྱོང་ངོ་། །
en: For forty thousand years, they did not sleep, eat to fullness, or rest; they did not even sit down or walk around anywhere.

source: དེ་ནས་ཡང་ལོ་བཞི་ཁྲིའི་བར་དུ་གཞན་ཅི་ཡང་མི་སེམས་ཏེ། ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ཡང་དག་པ་མ་ཡིན་པ་དང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་སེམས་སོ། །
en: Then, for forty thousand years, they thought of nothing other than the characteristics of falsity and emptiness of the five aggregates for appropriation.

source: དེ་ལྟར་ཕུང་པོ་ལྔ་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བར་ཤེས་ནས་
en: Having understood the five aggregates to arise from mistaken perception,

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔའི་མཚན་ཉིད་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པར་བྱ་བ་ལ་བརྩམས་བཞིན་དུ་ཚེ་ལ་ཐུག་གི་བར་དུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་དོ། །
en: they spent their lives practicing pure conduct, while understanding and realizing the characteristics of the five aggregates for appropriation.

source: དེ་ནས་ཚེ་འཕོས་ནས་དགའ་ལྡན་གནས་སུ་སྐྱེས་སོ། །
en: When they passed away, they were born in the Heaven of Joy.

source: བཅོམ་ལྡན་འདས་དེ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཕྱིར་ཡང་འཛམ་བུ་གླིང་འདིར་ཁྱིམ་བདག་ཆེན་པོ་ཞིག་གི་ཁྱིམ་དུ་སྐྱེས་ནས་ལོ་བཅུ་དྲུག་ལོན་པ་དང་། ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་སྟེ
en: After the Blessed One passed into nirvāṇa, they were born into the family of an important householder here in Jambudvīpa, and once again, at the age of sixteen, saw the Thus-Gone One in a dream, where

source: ཕུང་པོ་ལྔ་དང་ཁམས་བཅྭ་བརྒྱད་བཤད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ཀྱི་མདོ་སྡེ་བསྟན་པར་རྨིས་སོ། །
en: they dreamt that he taught them the discourse called The Skillful Means of Bodhisattvas , in which the five aggregates and the eighteen elements are explained.

source: རྨི་ལམ་ན་ཆོས་འདི་ཐོས་ནས་སད་པ་དང་། དངངས་སྐྲག་སྟེ།
en: Having heard this teaching in the dream, they awoke with a start.

source: བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་ལོ་ཁྲི་ཚང་བར་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིང་ཕུང་པོ་ལྔ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་བཤད་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཐབས་ཀྱི་མདོ་སྡེ་ཞིབ་ཏུ་བརྟགས་ནས་
en: They engaged in pure conduct for a full ten thousand years, following the teachings of the Blessed One, carefully investigating the discourse called The Skillful Means of Bodhisattva Conduct , in which the five aggregates, twelve sense sources, and eighteen elements are explained.

source: དེ་ནས་ཚེ་འཕོས་ཏེ་སུམ་ཅུ་རྩ་གསུམ་གནམ་དུ་སྐྱེས་སོ། །
en: Then, once they passed away, they were born in the Heaven of the Thirty-Three.

source: ལྷའི་ཚེ་ཟད་ནས་ཕྱིར་ཡང་འཛམ་བུའི་གླིང་དུ་རིགས་མཐོ་ཞིང་ཆེ་བའི་བྲམ་ཟེའི་ཁྱིམ་དུ་སྐྱེས་སོ། །
en: When their divine lifespan was spent, they were born once again here in Jambudvīpa into an important, high-caste Brahmin family.

source: བཅོམ་ལྡན་འདས་བློ་གྲོས་ཆེན་པོ་རིའི་རྒྱལ་པོའི་ཆོས་རྣམ་པར་ཞིག་ནས་ལོ་སྟོང་ལོན་ཏེ་
en: One thousand years after the Dharma of the blessed Royal Mountain of Great Intelligence had disappeared,

source: རྒྱལ་བུ་དེ་གཉིས་སྔོན་གྱི་རྒྱུ་དང་རྐྱེན་གྱིས་དེར་ཡང་རབ་ཏུ་བྱུང་ནས་
en: the two princes received ordination based upon their previous causes and conditions.

source: ཤེས་རབ་རྒྱ་མཚོ་དང་འདྲ་བར་ཤེས་པར་ཤིན་ཏུ་རྒྱ་ཆེ་བར་གྱུར་ཏེ་
en: Their understanding grew vast, with insight as vast as the ocean.

source: ཕུང་པོའི་མཚན་ཉིད་རྣམ་པར་འབྱེད་ཅིང་ཤིན་ཏུ་རྟོག་པ་ལ་མཁས་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མངོན་སུམ་དུ་རྟོགས་པར་གྱུར་ཏོ། །
en: They became skilled in discerning and reflecting upon the characteristics of the aggregates, and came to understand them directly and accurately.

source: འཇིག་རྟེན་འཛིན་དེ་ན་མི་ཉི་ཁྲི་སྙེད་དང་། ལྷ་ཁྲི་ཕྲག་ཉི་ཤུ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ། །
en: Lokadhara, they established twenty thousand humans and two hundred thousand gods in unsurpassed and perfect awakening.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་ཀྱིས་དེ་ནས་གང་ནས་གང་དུ་སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་སེམས་ཅན་འཐུན་པར་གྱུར་ནས་
en: “Lokadhara, these two bodhisattvas were close companions wherever they were born.

source: སངས་རྒྱས་ཁྲག་ཁྲིག་ཁྲི་ཕྲག་བཅུ་དང་ཕྲད་དེ་བསྙེན་བཀུར་བྱས་པར་གྱུར་ཏོ། །
en: They met and served a quadrillion buddhas.

source: དེ་ནས་གདོད་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: They then gained the acceptance that phenomena are primordially unborn.

source: མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་ནས་
en: Once they gained the acceptance that phenomena are unborn,

source: གཞན་ཡང་སངས་རྒྱས་ཁྲག་ཁྲིག་ཁྲི་ཕྲག་གཅིག་དང་ཕྲད་དེ། དེ་ནས་གདོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་རོ། །
en: they once again met a quadrillion buddhas, and eventually went on to attain unsurpassed and perfect awakening.

source: དེ་གཉིས་ཀྱང་བསྐལ་པ་གཅིག་ཏུ་རིམ་གྱིས་འཚང་རྒྱ་སྟེ། གཅིག་ནི་ཚད་མེད་དབྱངས་ཞེས་བྱ། གཅིག་ནི་ཚད་མེད་འོད་ཅེས་བྱའོ། །
en: The two of them sequentially awakened to buddhahood during the same eon, where one became known as Limitless Voice, and the other, Limitless Light.

source: འཇིག་རྟེན་འཛིན་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འདོད་པ་དག་རྣམ་པར་དག་ཅིང་ཤིན་ཏུ་བྱང་བའི་ཆོས་བསྒོམ་པ་ལ་ཤིན་ཏུ་བརྩོན་པར་བྱའོ། །
en: Lokadhara, it must therefore be understood that bodhisattva great beings who wish swiftly to attain unsurpassed and perfect awakening should exert themselves in cultivating the pure and excellent Dharma.

source: གཞན་ཡང་ཕུང་པོའི་མཚན་ཉིད་ལ་འཇུག་པར་དང་། འདུས་བྱས་ཀྱི་ཆོས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་མཁས་པར་བྱའོ། །
en: Additionally, they should become skilled in understanding the characteristics of the aggregates and skilled in the actual characteristics of conditioned phenomena.”

source: ཕུང་པོ་ལྔ་ལ་བརྟགས་པའི་ལེའུ་སྟེ་གཉིས་སོ།། །།
en: This was chapter two:“ Investigating the Five Aggregates .”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཁམས་བཅྭ་བརྒྱད་ལ་མཁས་པ་ཞེ་ན།
en: “Lokadhara, regarding the elements, how are bodhisattva great beings learned in the eighteen elements?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཁམས་བཅྭ་བརྒྱད་ལ་ཡང་དག་པར་རྟོག་པར་སྦྱོར་བ་ན་འདི་སྙམ་དུ་
en: When bodhisattva great beings practice correct contemplation of the eighteen elements, they think,

source: མིག་གི་ཁམས་ཞེས་བྱ་བ་མིག་གི་ཁམས་སུ་དམིགས་སུ་མེད།
en: ‘The eye element cannot be observed to be the eye element.

source: མིག་གི་ཁམས་ལ་བདག་དང་བདག་གི་བ་མེད་པ། མི་རྟག་པ། སྙིང་པོ་མེད་པ། རང་བཞིན་གྱིས་སྟོང་པའི་ཕྱིར་
en: There is also no I or mine in the eye element. It is impermanent, insubstantial, and empty of inherent nature. Therefore,

source: མིག་གི་ཁམས་ལ་མིག་གི་མཚན་ཉིད་དུ་བཏགས་པ་མི་དམིགས།
en: what is imputed as the characteristic of the eye element cannot be observed in the eye element.

source: མིག་གི་ཁམས་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཇི་ཡང་མེད་པ་སྟེ།
en: The eye element is untrue and totally nonexistent, for

source: རྣམ་པར་རྟོག་པ་ལས་སྐྱེས་སོ། །
en: it is born from false thinking.

source: མིག་གི་ཁམས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་དེ།
en: The eye element lacks true characteristics, as

source: ནམ་མཁའི་ཁམས་ནི་མིག་གི་ཁམས་ཡིན་ནོ། །
en: the space element is the eye element.

source: དཔེར་ན་ནམ་མཁའི་ཁམས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་དེ། དངོས་པོ་མེད་པ་བཞིན་མིག་གི་ཁམས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་པ་དང་རང་དངོས་པོ་མེད་པ་ཡང་དེ་དང་འདྲའོ། །
en: For instance, just as the space element lacks true characteristics and is not an entity, the eye element also lacks true characteristics and is not an entity.

source: མིག་གི་ཁམས་ལ་ཡང་དག་པའི་དངོས་པོ་མི་རྙེད་པའི་ཕྱིར་མིག་གི་ཁམས་ཡུལ་ན་ཡང་མི་གནས། ཕྱོགས་ན་ཡང་མི་གནས།
en: Because no real entity can be found in the eye element, the eye element does not exist in any location or direction.

source: ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་ན་ཡང་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་པའི་ཕྱིར་རོ། །
en: It does not exist internally, externally, or somewhere in-between.

source: མིག་གི་ཁམས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་པ། དངོས་པོ་མེད་པས་མིག་གི་ཁམས་ཀྱི་དངོས་པོ་དམིགས་སུ་མེད་དེ།
en: The eye element lacks true characteristics and is not an entity. Thus, no entity of the eye element can be apprehended, for

source: རྒྱུ་དང་རྐྱེན་མང་པོ་ལས་སྐྱེས་སོ། །
en: it arises from many causes and conditions.

source: མིག་གི་ཁམས་འདས་པ་མ་ཡིན། མ་འོངས་པ་མ་ཡིན། ད་ལྟར་གྱི་མ་ཡིན་ཏེ།
en: The eye element is neither past, nor present, nor future, and

source: མིག་གི་ཁམས་ལ་མིག་གི་རང་བཞིན་དམིགས་སུ་མེད་དོ། །
en: there is no intrinsic nature of the eye to observe in the eye element.

source: མིག་གི་ཁམས་ནི་སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དང་ད་ལྟར་གྱི་རྐྱེན་ལ་རག་ལུས་ཏེ། མིག་གི་ཁམས་ཞེས་བཏགས་སོ། །
en: The eye element depends upon the ripening of the results of past actions and current conditions, whereupon the eye element is imputed.

source: མིག་གི་ཁམས་ཞེས་བྱ་བ་ནི་ཁམས་མེད་པའོ། །
en: The eye element is a nonelement.

source: མིག་གི་ཁམས་ལ་མིག་གི་ཁམས་དམིགས་སུ་མེད་དོ། །
en: No eye element can be observed in the eye element.

source: རྣམ་པར་ཤེས་པའི་སྤྱོད་ཡུལ་ལ་མིག་གི་ཁམས་ཞེས་བྱའོ། །
en: The so-called eye element refers to the domain of consciousness.

source: མིག་གི་དབང་པོའང་རྣམ་པར་དག་ལ་གཟུགས་ཀྱང་སྣང་བའི་གནས་ན་ཡོད་ཅིང་ཡིད་ཀྱི་དབང་པོར་ལྡན་ཏེ། རྣམ་པ་གསུམ་འདུས་པ་ན་མིག་གི་ཁམས་ཞེས་བྱའོ། །
en: The eye element manifests when three factors come together: a clear eye faculty, an apparent form, and the involvement of the mind faculty.

source: མིག་གི་ཁམས་ལ་ངེས་པར་མིག་གི་ཁམས་ཞེས་བྱ་བ་མེད་དེ།
en: The eye element lacks anything that can be called a real eye element , and

source: མཁས་པ་དག་ནི་མིག་གི་ཁམས་མེད་པ་ལ་མིག་གི་ཁམས་སུ་རྟོགས་སོ། །
en: the wise understand the eye element to be the absence of the eye element.’ ”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གལ་ཏེ་དེ་ལྟར་མིག་གི་ཁམས་རྣམ་པར་འབྱེད་པ་རྟོགས་ནས་
en: “Lokadhara, if bodhisattva great beings contemplate the discernment of the eye element in this manner,

source: ཁམས་མེད་པ་ལ་གཟུགས་ཀྱི་ཁམས་སུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: they will understand the form element to be a nonelement.

source: གཟུགས་ཀྱི་ཁམས་ལ་གཟུགས་ཀྱི་ཁམས་སུ་མེད་དེ།
en: There is no element of form that can be observed in the form element, for

source: གཟུགས་ཀྱི་ཁམས་ནི་མ་འདུས་པ་མ་བྱས་པའོ། །
en: the form element is uncompounded and uncreated.

source: གཟུགས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་གཟུགས་ཀྱི་ཁམས་ཞེས་བྱའོ། །
en: Because form is devoid of any true characteristics, it is called the form element .

source: གཟུགས་ལ་དངོས་པོ་མེད་དེ་རྣམ་པར་རྟོག་པའང་མེད་ན་གཟུགས་ཀྱི་ཁམས་ཞེས་བྱ་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: If form is insubstantial, lacking even concepts of it, what need is there to mention the so-called form element?

source: གཟུགས་ཀྱི་ཁམས་ཞེས་བྱ་བ་ནི་དངོས་པོ་མེད་པས་གཟུགས་ཀྱི་མཚན་ཉིད་ནི་གཟུགས་ཀྱི་ནང་ན་ཡང་མི་གནས། གཟུགས་ཀྱི་ཕྱི་རོལ་ན་ཡང་མི་གནས། གཉི་གའི་བར་ན་ཡང་མི་གནས་ཏེ།
en: Because the so-called form element is not an entity, the characteristic of form does not exist within form, outside of form, or somewhere in-between. Rather,

source: རྣམ་པར་བརྟགས་པ་དང་། གཟུགས་མངོན་དུ་སྣང་བའི་གནས་ན་ཡོད་ལ་མིག་གི་དབང་པོ་ཡང་རྣམ་པར་དག་ཅིང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་ལྡན་པ་ལས་གཟུགས་མངོན་པར་སྣང་སྟེ
en: it is imputed. Form appears due to the combination of a location where forms can appear, the presence of an uncorrupted eye faculty, and the involvement of the mind consciousness.

source: གཟུགས་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ། །
en: This is called the characteristic of form .

source: དཔེར་ན་མེ་ལོང་གི་ནང་གི་གཟུགས་བརྙན་དང་འདྲ་སྟེ།
en: It is similar to a reflection in a mirror.

source: མེ་ལོང་ཡོངས་སུ་དག་ན་གཟུགས་ཀྱི་མཚན་ཉིད་མངོན་པར་སྣང་བར་འགྱུར་རོ། །
en: If the mirror is unblemished, the characteristic of form will appear in it.

source: གཟུགས་ལ་ངེས་པའི་མཚན་ཉིད་མེད་དེ།
en: But form in fact has no true characteristics;

source: མེ་ལོང་གི་ནང་ན་མི་མེད་བཞིན་དུ་གཟུགས་ཀྱི་གཟུགས་བརྙན་སྣང་ངོ་། །
en: the reflection of a form appears in the mirror even as there is no person there.

source: དེ་ཡང་ཕྱི་རོལ་ན་མེ་ལོང་ཡོད་ན་ནང་ནས་གཟུགས་ཀྱི་མཚན་ཉིད་འབྱུང་ངོ་། །
en: Further, even if there is a mirror outside, the characteristic of form arises from within.

source: དེ་བཞིན་དུ་མིག་གི་དབང་པོ་རྣམ་པར་དག་པ་ན་གཟུགས་སྣང་བའི་གནས་ན་འདུག་པ་ལ་དམིགས་ནས་མེ་ལོང་གི་གཟུགས་བརྙན་དང་འདྲ་བ་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་ཅེས་བཏགས་སོ། །
en: Similarly, when an uncorrupted eye faculty is present in a location where forms are visible, much like the reflection in a mirror, the resulting apprehension can be labeled the characteristic of form .

source: གཟུགས་ལ་ཁམས་མེད། དབྱིབས་ཀྱི་མཚན་མ་མེད། ངེས་པའི་མཚན་ཉིད་མེད་པས་གཟུགས་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ། །
en: Form is devoid of elements, shapes, and true characteristics. These are the so-called characteristics of form.

source: གཟུགས་ཀྱི་མཚན་ཉིད་ལ་བདག་མེད་པའི་ཕྱིར་གཟུགས་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ། །
en: Because the characteristics of form are devoid of self, they are called the characteristics of form .

source: སེམས་ཅན་གྱི་རྗེས་སུ་ཇི་ལྟ་ཇི་ལྟ་བ་དེ་ལྟར་དེ་བཞིན་དུ་ཤེས་པའི་ཕྱིར་གཟུགས་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ། །
en: Because they are perceived according to the individual in question, they are called the characteristics of form .

source: གང་ཟག་སུ་ཞིག་གཟུགས་ཀྱི་མཚན་ཉིད་ཤེས་ན་གཟུགས་མེད་པའི་མཚན་ཉིད་ཀྱང་ཤེས་སོ། །
en: Any person who understands the characteristics of form also understands the characteristics of the absence of form.
